---
kind: method
id: M:Autodesk.Revit.DB.Structure.FamilyStructuralMaterialTypeFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralMaterialType)
source: html/6231e802-f291-be9f-fc76-59d28b73e5f1.htm
---
# Autodesk.Revit.DB.Structure.FamilyStructuralMaterialTypeFilter.#ctor Method

Constructs a new instance of a filter to match families that have the given structural material type.

## Syntax (C#)
```csharp
public FamilyStructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType
)
```

## Parameters
- **structuralMaterialType** (`Autodesk.Revit.DB.Structure.StructuralMaterialType`) - The structural material type to match.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration